app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "email") VALUES('Silvio Bertinotti', '3b70d4c96ea01be2fcbad6777a3fa27621ef545c5cbad55a4a6845e1b8b1eca1', '16c5cc4b8a782cea0a3fb53d8485e7eca468c45e559dc3940d715874b7efbb39', '2010-08-22 21:58:55', '2010-08-22 21:58:55', 'silvio.bertinotti@lapolitica.com')